Refactor attack simulation model
